---
kind: property
id: P:Autodesk.Revit.DB.Analysis.MEPAnalyticalSegment.Id
source: html/ca7e1bcf-41a5-d256-7741-850a14b9c08f.htm
---
# Autodesk.Revit.DB.Analysis.MEPAnalyticalSegment.Id Property

The identity of this segment.

## Syntax (C#)
```csharp
public int Id { get; }
```